rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
	RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL1.PLLM = 4;
	RCC_OscInitStruct.PLL1.PLLN = 75;
	RCC_OscInitStruct.PLL1.PLLFractional = 0;
	RCC_OscInitStruct.PLL1.PLLP1 = 1;
	RCC_OscInitStruct.PLL1.PLLP2 = 1;
	RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL4.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL4.PLLM = 1;
	RCC_OscInitStruct.PLL4.PLLN = 25;
	RCC_OscInitStruct.PLL4.PLLFractional = 0;
	RCC_OscInitStruct.PLL4.PLLP1 = 1;
	RCC_OscInitStruct.PLL4.PLLP2 = 1;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_HCLK |
	RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 |
	RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK5 |
	RCC_CLOCKTYPE_PCLK4;
	RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
	RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
	RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;
	RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC1Selection.ClockDivider = 2;
	RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC2Selection.ClockDivider = 3;
	RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC6Selection.ClockDivider = 4;
	RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC11Selection.ClockDivider = 3;
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK) {
		Error_Handler();
	}
}

/**
 * @brief Re-apply the camera kernel clocks after CubeMX peripheral init.
 *
 * CubeMX regenerates the DCMIPP MSP clock config with defaults that do not
 * match the working IMX335 capture path. Keeping the final override here in
 * application code makes it much less likely to be lost on regeneration.
 */
static void App_CameraKernelClock_Config(void) {
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };

	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP
			| RCC_PERIPHCLK_CSI;
	PeriphClkInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
	PeriphClkInitStruct.ICSelection[RCC_IC17].ClockSelection =
	RCC_ICCLKSOURCE_PLL1;
	PeriphClkInitStruct.ICSelection[RCC_IC17].ClockDivider = 4;
	PeriphClkInitStruct.ICSelection[RCC_IC18].ClockSelection =
	RCC_ICCLKSOURCE_PLL1;
	/* 1.2 GHz / 50 = 24 MHz, which matches the IMX335 input clock setting. */
	PeriphClkInitStruct.ICSelection[RCC_IC18].ClockDivider = 50;

	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
		Error_Handler();
	}
}

/**
 * @brief Mark the camera DMA buffer region as non-cacheable.
 *
 * This mirrors the ST reference application, which places capture buffers in a
 * dedicated memory section and protects that section with the MPU so DCMIPP
 * writes are visible to the CPU without stale-cache effects.
 */
static void Setup_Mpu(void) {
	MPU_Attributes_InitTypeDef attr = { 0 };
	MPU_Region_InitTypeDef region = { 0 };
	MPU_Attributes_InitTypeDef snapshot_attr = { 0 };
	MPU_Region_InitTypeDef snapshot_region = { 0 };

	attr.Number = MPU_ATTRIBUTES_NUMBER0;
	attr.Attributes = MPU_NOT_CACHEABLE;
	HAL_MPU_ConfigMemoryAttributes(&attr);

	region.Enable = MPU_REGION_ENABLE;
	region.Number = MPU_REGION_NUMBER0;
	region.BaseAddress = (uint32_t) &__snoncacheable;
	region.LimitAddress = (uint32_t) &__enoncacheable - 1U;
	region.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
	region.AccessPermission = MPU_REGION_ALL_RW;
	region.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
	region.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
	region.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	HAL_MPU_ConfigRegion(&region);

	/* Region 1 has higher priority than the DMA region above. Keep the private
	 * snapshot non-cacheable as well: a long CPU copy otherwise fills D-cache,
	 * then stalls when dirty lines are evicted to AXISRAM1. */
	snapshot_attr.Number = MPU_ATTRIBUTES_NUMBER1;
	snapshot_attr.Attributes = MPU_NOT_CACHEABLE;
	HAL_MPU_ConfigMemoryAttributes(&snapshot_attr);

	snapshot_region.Enable = MPU_REGION_ENABLE;
	snapshot_region.Number = MPU_REGION_NUMBER1;
	snapshot_region.BaseAddress = (uint32_t) camera_inference_frame_snapshot;
	snapshot_region.LimitAddress =
		(uint32_t) camera_inference_frame_snapshot +
		CAMERA_CAPTURE_BUFFER_SIZE_BYTES - 1U;
	snapshot_region.AttributesIndex = MPU_ATTRIBUTES_NUMBER1;
	snapshot_region.AccessPermission = MPU_REGION_ALL_RW;
	snapshot_region.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
	snapshot_region.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
	snapshot_region.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	HAL_MPU_ConfigRegion(&snapshot_region);
	HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
	/* NOTE: do NOT memset the noncacheable buffer here — it lives at the NS alias
	 * address (0x24xxxxxx) which RISAF1 may not yet be open at this point in the
	 * init sequence.  The capture code fills the buffer with 0xAA sentinel before
	 * each DMA, so zero-init here is not required. */
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/
	HAL_Init();

#if APP_LED_ONLY_SMOKE_TEST
  MX_GPIO_Init();
  MX_LPUART1_UART_Init();
  printf("[APP] HAL_Init OK\r\n");
  App_SystemClock_Config();
  printf("[APP] App_SystemClock_Config OK\r\n");
  BSP_LED_Init(LED_RED);
  printf("[APP] Entering smoke-test blink loop\r\n");
  while (1)
  {
    BSP_LED_Toggle(LED_RED);
    HAL_Delay(100U);
  }
  return 0;
#else
	/* USER CODE BEGIN Init */
	App_SystemClock_Config();
	Setup_Mpu();

	/* USER CODE END Init */

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_LPUART1_UART_Init();
	MX_SPI5_Init();
	MX_DCMIPP_Init();
	App_CameraKernelClock_Config();
	/* The FSBL drives PWR_EN (PD10) LOW to initialise it as an output. If the
	 * DS3231 or its I2C pull-up resistors are on that power rail it will be
	 * unpowered when we arrive here from the FSBL boot path. Assert the pin HIGH
	 * and wait for the DS3231 to complete its power-on sequence (t_VCC_SDA ≤ 1ms
	 * per datasheet, 10ms to be safe) before initialising I2C1. */
	{
		GPIO_InitTypeDef pwr_gpio = { 0 };
		pwr_gpio.Pin = GPIO_PIN_10;
		pwr_gpio.Mode = GPIO_MODE_OUTPUT_PP;
		pwr_gpio.Pull = GPIO_NOPULL;
		pwr_gpio.Speed = GPIO_SPEED_FREQ_LOW;
		__HAL_RCC_GPIOD_CLK_ENABLE();
		HAL_GPIO_Init(GPIOD, &pwr_gpio);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_SET);
		HAL_Delay(10U);
	}

	MX_I2C1_Init();
	MX_I2C2_Init();

