rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
	/* set all required IPs as secure privileged */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	/* RISAF (memory region access filter) needs its own AHB3 clock. Without
	 * this, writes to RISAF2_S->REG[0].CFGR are silently dropped. */
	__HAL_RCC_RISAF_CLK_ENABLE();

	/*RIMC configuration*/
	RIMC_MasterConfig_t dcmipp_master = { 0 };
	RIMC_MasterConfig_t eth1_master = { 0 };

	dcmipp_master.MasterCID = RIF_CID_1;
	/* The ST forum fix for the N6 raw-dump/HPDMA symptom configures DCMIPP as
	 * secure and privileged on both the master and slave sides. We mirror that
	 * here so Pipe0 follows the same isolation model as the known-good setup. */
	dcmipp_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP,
			&dcmipp_master);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP,
	RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);

	eth1_master.MasterCID = RIF_CID_1;
	eth1_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_NPRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_ETH1, &eth1_master);

	/* RIF-Aware IPs Config */

	/* set up GPIO configuration */
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_0,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_3,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_5,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_7,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_10,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_11,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_0,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_3,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_6,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_7,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_10,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_11,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOD, GPIO_PIN_2,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOD, GPIO_PIN_10,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_3,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_5,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_6,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_15,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOG, GPIO_PIN_1,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOG, GPIO_PIN_2,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPION, GPIO_PIN_7,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOO, GPIO_PIN_5,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);

	/* USER CODE BEGIN RIF_Init 1 */

	/* Disable all RIF security on AXISRAM1/2 so any master (including DCMIPP,
	 * whose AXI transactions arrive non-secure regardless of RIMC config) can
	 * read and write freely. RISC: non-secure, non-privileged. RISAF: BREN=0
	 * (filter disabled — all accesses pass through). */
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_AXISRAM1,
	RIF_ATTRIBUTE_NPRIV);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_AXISRAM2,
	RIF_ATTRIBUTE_NPRIV);

	{
		volatile uint32_t r1_cfgr;
		volatile uint32_t r2_cfgr;
		volatile uint32_t r2_cidcfgr;
		volatile uint32_t r2_startr;
		volatile uint32_t r2_endr;
		volatile uint32_t r3_cfgr;
		volatile uint32_t r3_cidcfgr;

		/* RISAF1 guards SRAM1 NS alias — disable the filter (belt-and-suspenders). */
		RISAF1_NS->REG[0].STARTR = 0x00000000U;
		RISAF1_NS->REG[0].ENDR = 0x000FFFFFU;
		RISAF1_NS->REG[0].CIDCFGR = 0x00000000U;
		RISAF1_NS->REG[0].CFGR = 0x00000000U; /* BREN=0, SEC=0 — no filtering */
		RISAF1_NS->IACR = 0xFFFFFFFFU; /* clear any stale illegal-access flags */

		/* RISAF2 guards the AXISRAM1 secure alias — disable filters so DCMIPP
		 * (MSEC=1) can write to the capture buffer even when we move it to the
		 * non-secure alias for this A/B test. */
		RISAF2_S->REG[0].STARTR = 0x00000000U;
		RISAF2_S->REG[0].ENDR = 0x000FFFFFU;
		RISAF2_S->REG[0].CIDCFGR = 0x00000000U;
		RISAF2_S->REG[0].CFGR = 0x00000000U; /* BREN=0 — no filtering */
		RISAF2_S->IACR = 0xFFFFFFFFU;
		RISAF2_NS->REG[0].STARTR = 0x00000000U;
		RISAF2_NS->REG[0].ENDR = 0x000FFFFFU;
		RISAF2_NS->REG[0].CIDCFGR = 0x00000000U;
		RISAF2_NS->REG[0].CFGR = 0x00000000U;
		RISAF2_NS->IACR = 0xFFFFFFFFU;

		/* RISAF3 guards AXISRAM2 — disable the filter */
		RISAF3_NS->REG[0].STARTR = 0x00000000U;
		RISAF3_NS->REG[0].ENDR = 0x000FFFFFU;
		RISAF3_NS->REG[0].CIDCFGR = 0x00000000U;
		RISAF3_NS->REG[0].CFGR = 0x00000000U; /* BREN=0, SEC=0 — no filtering */
		RISAF3_NS->IACR = 0xFFFFFFFFU; /* clear any stale illegal-access flags */

		/* Readback to confirm writes were accepted. */
		r1_cfgr = RISAF1_NS->REG[0].CFGR;
		r2_cfgr = RISAF2_NS->REG[0].CFGR;
		r2_cidcfgr = RISAF2_NS->REG[0].CIDCFGR;
		r2_startr = RISAF2_NS->REG[0].STARTR;
		r2_endr = RISAF2_NS->REG[0].ENDR;
		r3_cfgr = RISAF3_NS->REG[0].CFGR;
		r3_cidcfgr = RISAF3_NS->REG[0].CIDCFGR;
		DebugConsole_Printf(
				"[RIF] RISAF1 REG0: CFGR=0x%08lX (NS alias 0x24xxxxxx)\r\n",
				(unsigned long) r1_cfgr);
		DebugConsole_Printf(
				"[RIF] RISAF2 NS REG0: CFGR=0x%08lX CIDCFGR=0x%08lX STARTR=0x%08lX ENDR=0x%08lX | S CFGR=0x%08lX\r\n",
				(unsigned long) r2_cfgr, (unsigned long) r2_cidcfgr,
				(unsigned long) r2_startr, (unsigned long) r2_endr,
				(unsigned long) RISAF2_S->REG[0].CFGR);
		DebugConsole_Printf(
				"[RIF] RISAF3 REG0: CFGR=0x%08lX CIDCFGR=0x%08lX\r\n",
				(unsigned long) r3_cfgr, (unsigned long) r3_cidcfgr);
	}

	/* USER CODE END RIF_Init 1 */
	/* USER CODE BEGIN RIF_Init 2 */

	/* Enable AXISRAM1 explicitly as well as the NPU SRAM clocks. The camera DMA
	 * alias and the private debug snapshot both live in AXISRAM1; relying on its
	 * reset-default clock state made CPU writes to the snapshot stall on one
	 * board boot even though DCMIPP could still fill the DMA window. */
	RCC->MEMENR |= RCC_MEMENR_AXISRAM1EN | RCC_MEMENR_AXISRAM2EN
			| RCC_MEMENR_AXISRAM3EN
			| RCC_MEMENR_AXISRAM4EN | RCC_MEMENR_AXISRAM5EN
			| RCC_MEMENR_AXISRAM6EN;
	RAMCFG_SRAM1_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM2_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM3_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM4_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM5_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM6_AXI->CR &= ~RAMCFG_CR_SRAMSD;

	/* USER CODE END RIF_Init 2 */
}

/**
 * @brief SPI5 Initialization Function
 * @param None
 * @retval None
 */
static void MX_SPI5_Init(void) {

